In [36]:
import json
import gc
from tqdm import tqdm
import numpy as np
import pandas as pd

In [37]:
def load_json_data():
    gc.collect()
    with open(f'../data/amazon_rating.json', 'r') as json_file :
        for line in json_file :
            data = json.loads(line)
            yield data['reviewerID'], data['asin']

In [38]:
arr = []
i = 0
for data in tqdm(load_json_data()):
    arr.append(data)
    # i+=1
    # if i == 10 :
    #     break

51311621it [09:08, 93613.16it/s]

In [39]:
df = pd.DataFrame(arr)

In [40]:
books = df[0].unique()

In [41]:
users = df[1].unique()

In [42]:
len(users)

2930451

In [43]:
len(books)

15362619

In [20]:
51311621 / (2930451 * 15362619) * 100

0.0001139766822298452

In [36]:
len(df) / (len(users) * len(books)) * 100

0.0001256026499626508

In [38]:
(2934949 - 2603354) / 2934949

0.11298152029217544

:

In [47]:
df

                       0           1
0         A1C6M8LCIX4M6M  0001713353
1         A1REUF3A1YCPHM  0001713353
2          A1YRBRK2XM5D5  0001713353
3         A1V8ZR5P78P4ZU  0001713353
4         A2ZB06582NXCIV  0001713353
...                  ...         ...
51276081  A2TJQZFD83M4U3  1533033358
51276082  A13237H26K6QRL  1533033358
51276083  A2L8PRFL2S5L0K  1533033358
51276086  A13237H26K6QRL  153303379X
51276098   AJHFSHPU4IOZB  8417067701

[49453632 rows x 2 columns]

In [45]:
df.drop(df[(df[1].str.match('B'))].index, inplace=True)

In [58]:
book_cnt = df.groupby(0, as_index=False).agg({1 : 'count'})

In [51]:
user_cnt = df.groupby(1, as_index=False).agg({0 : 'count'})

In [33]:
user_cnt

                  1   0
0        0000000116   2
1        0000000868   1
2        0000001589   1
3        0000004545   2
4        0000013765  25
...             ...  ..
2603247  9999943802   4
2603248  9999963676   1
2603249  9999982654   1
2603250  9999990223   1
2603251  9999991483   1

[2603252 rows x 2 columns]

In [9]:
df

                       0           1
0         A1C6M8LCIX4M6M  0001713353
1         A1REUF3A1YCPHM  0001713353
2          A1YRBRK2XM5D5  0001713353
3         A1V8ZR5P78P4ZU  0001713353
4         A2ZB06582NXCIV  0001713353
...                  ...         ...
51276081  A2TJQZFD83M4U3  1533033358
51276082  A13237H26K6QRL  1533033358
51276083  A2L8PRFL2S5L0K  1533033358
51276086  A13237H26K6QRL  153303379X
51276098   AJHFSHPU4IOZB  8417067701

[49453632 rows x 2 columns]

In [23]:
user_list = list(book_cnt[book_cnt[1] > 10][0])

In [53]:
user_cnt

                  1   0
0        0000000116   2
1        0000000868   1
2        0000001589   1
3        0000004545   2
4        0000013765  25
...             ...  ..
2603247  9999943802   4
2603248  9999963676   1
2603249  9999982654   1
2603250  9999990223   1
2603251  9999991483   1

[2603252 rows x 2 columns]

In [54]:
df_t

                       0           1
139       A2VDN6OJOIY74W  0002005263
140       A1POJBC0L210UT  0002005263
141       A2X9XKFB18UQCU  0002005263
142        AEC46NVS07MJ9  0002005263
143        A9ANMVCEOQ8P7  0002005263
...                  ...         ...
51273751   AIVBMXYCVSFLN  1684330718
51273752  A3BWPO0JZK7O2Q  1684330718
51273753  A1RKBN23T4O8C7  1684330718
51273754  A31BN3V5GS79WA  1684330718
51273755  A1BQW52ICTBXGH  1684330718

[26951054 rows x 2 columns]

In [69]:
book_list = list(user_cnt[user_cnt[0] > 100][1])
user_list = list(book_cnt[book_cnt[1] > 100][0])

df_t = df.loc[df[0].isin(user_list)]
df_t = df_t.loc[df_t[1].isin(book_list)]
user_len = len(df_t[0].unique())
book_len = len(df_t[1].unique())
print(f'truc : {100}, rating : {len(df_t)}, book_cnt : {book_len}, user_cnt : {user_len}')

truc : 100, rating : 2876441, book_cnt : 77700, user_cnt : 24176

In [68]:
user_cnt

                  1   0
0        0000000116   2
1        0000000868   1
2        0000001589   1
3        0000004545   2
4        0000013765  25
...             ...  ..
2603247  9999943802   4
2603248  9999963676   1
2603249  9999982654   1
2603250  9999990223   1
2603251  9999991483   1

[2603252 rows x 2 columns]

In [48]:
arr = []
for i in range(10,100):
    book_list = list(user_cnt[user_cnt[0] > i][1])
    df_t = df.loc[df[1].isin(book_list)]
    user_cnt = len(df_t[0].unique())
    book_cnt = len(df_t[1].unique())
    print(f'truc : {i}, rating : {len(df)}, book_cnt : {len(book_cnt)}, user_cnt : {len(user_cnt)}')

KeyboardInterrupt:

In [32]:
pd.DataFrame(arr)[1]

0     2603252
1     1921473
2     1540170
3     1294390
4     1119988
       ...
95      84529
96      83608
97      82674
98      81691
99      80860
Name: 1, Length: 100, dtype: int64

In [25]:
for d in df[1] :
    if len(d) != 10:
        print(d)

In [28]:
df_t = df.loc[df[0].isin(user_list)]

In [29]:
df_t = df_t.loc[df[1].isin(book_list)]

In [30]:
df_t

                       0           1
1         A1REUF3A1YCPHM  0001713353
6          AVP0HXC9FG790  0001713353
12        A2RE7WG349NV5D  0001713353
23        A3H9YD6K9TVKDP  0001713353
24         A3M314LI9OYME  0001713353
...                  ...         ...
51311557   A8ZI6L56V7MPP  B01HJ56VC4
51311558  A2HEB3SO7UJFI4  B01HJ56VC4
51311584  A2AYU3DW4HHCSJ  B01HJ8KWDU
51311586  A27FN30I1OVZM9  B01HJ8KWDU
51311591  A28D20IM3BNAJ1  B01HJ8KWDU

[19295707 rows x 2 columns]

In [31]:
len(df_t) / (len(book_list) * len(user_list)) * 100

0.004075411144894602

In [32]:
len(user_list)

729092

In [33]:
len(book_list)

649392

In [10]:
i = 0
with open('../data/isbn.txt', 'w') as f :
    for data in tqdm(load_json_data()):
        i += 1
        f.write(data)
        if i % 1000 == 0:
            f.write('\n')
        else:
            f.write(',')

2934949it [00:50, 57971.66it/s]

NameError: name 'tqdm' is not defined